# Element Operating

In [1]:
import numpy as np
import pandas as pd

In [2]:
s1 = np.random.randint(10, size = 5)
s2 = np.random.randint(10, size = 5)
s3 = np.random.randint(10, size = 5)

In [3]:
sozluk = {"var1":s1, "var2":s2, "var3":s3}
sozluk

{'var1': array([5, 8, 4, 7, 1]),
 'var2': array([4, 6, 8, 6, 8]),
 'var3': array([3, 1, 9, 8, 9])}

In [4]:
df = pd.DataFrame(sozluk)

In [5]:
df

   var1  var2  var3
0     5     4     3
1     8     6     1
2     4     8     9
3     7     6     8
4     1     8     9

In [6]:
 df[0:1]

   var1  var2  var3
0     5     4     3

In [7]:
df.index

RangeIndex(start=0, stop=5, step=1)

In [8]:
df.index = ["a","b","c","d","e"]

In [9]:
df.index

Index(['a', 'b', 'c', 'd', 'e'], dtype='object')

In [10]:
df["c":"e"]

   var1  var2  var3
c     4     8     9
d     7     6     8
e     1     8     9

In [11]:
df.drop("a", axis = 0)

   var1  var2  var3
b     8     6     1
c     4     8     9
d     7     6     8
e     1     8     9

In [12]:
df

   var1  var2  var3
a     5     4     3
b     8     6     1
c     4     8     9
d     7     6     8
e     1     8     9

In [13]:
df.drop("a", axis = 0, inplace = True)

In [14]:
df

   var1  var2  var3
b     8     6     1
c     4     8     9
d     7     6     8
e     1     8     9

In [15]:
l = ["c","e"]

In [18]:
df.drop(l, axis = 0)

   var1  var2  var3
b     8     6     1
d     7     6     8

In [19]:
"var1" in df

True

In [22]:
l = ["var1","var4","var2"]

In [25]:
for i in l:
    print(i in df)

True
False
True

In [27]:
df

   var1  var2  var3
b     8     6     1
c     4     8     9
d     7     6     8
e     1     8     9

In [36]:
df["var4"] = [1,2,3,4]

In [37]:
df

   var1  var2  var3  var4
b     8     6     1     1
c     4     8     9     2
d     7     6     8     3
e     1     8     9     4

In [38]:
df.drop("var4", axis = 1 , inplace = True)

In [39]:
df

   var1  var2  var3
b     8     6     1
c     4     8     9
d     7     6     8
e     1     8     9

In [40]:
l = ["var1","var2"]

In [41]:
df.drop(l, axis = 1)

   var3
b     1
c     9
d     8
e     9

In [42]:
df

   var1  var2  var3
b     8     6     1
c     4     8     9
d     7     6     8
e     1     8     9